final data = [
  {
    'questionText': ' مقدار الوقت الذي تستغرقه الأفكار الوسواسية  ',
    'answers': [
      {'text': 'لاشيء', 'score': 0.0},
      {'text': 'أقل من ساعة في اليوم ، أو تتكررأحيانا (بمعدل 8 مرات فأقل يوميا) ', 'score':1.0},
      {'text': ' من ساعة إلى 3 ساعات في اليوم او تتكرر كثيرا (أكثر من 8 مرات في اليوم لكن معظم ساعات اليوم خالية من الأفكار الوسواسية ', 'score': 2.0},
      {'text': ' من 3 إلى 8 ساعات في اليوم ، أو تحدث كثيرا جدا (تحدث أكثر من 8 مرات في اليوم وفي معظم ساعات اليوم)', 'score': 3.0},
      {'text': 'أكثر من 8 ساعات في اليوم ، أو تحدث بشكل دائم (أكثر من تحملها ونادرا ما ماتمر ساعة بدون وساوس كثيرة)', 'score':4.0},
    ]
  },
  {
    'questionText': 'مقدار التعارض الذي تحدثه الأفكار الوسواسية مع نشاطاتك الاجتماعية والعملية',
    'answers': [
      {'text': 'لايوجد', 'score': 0.0},
      {'text': '  تعارض خفيف مع النشاطات الاجتماعية أو العملية ولكن النشاط العام لا يتأثر', 'score': 1.0},
      {'text': 'تعارض واضح في النشاطات الاجتماعية أو العملية ولكن يمكن السيطرة عليه', 'score': 2.0},
      {'text': 'تسبب خللا كبيرا في أداء النشاطات الاجتماعية أو العملية', 'score': 3.0},
      {'text': ' تسبب خللا بليغا', 'score': 4.0},
    ]
  },
  {
    'questionText': 'مقدار التوتر والقلق المصاحب للأفكار الوسواسية',
    'answers': [
      {'text': 'لا يوجد', 'score': 0.0},
      {'text': 'خفيف (أحيانا)، ليس مزعجا', 'score': 1.0},
      {'text': 'متوسط (غالبا) ومزعجا ولكن يمكن السيطرة عليه', 'score': 2.0},
      {'text': 'شديد (أغلب الوقت) ومزعج جدا', 'score': 3.0},
      {'text': 'توتر بليغ (دائم)لحد الإعاقة تقريبا', 'score': 4.0},
    ]
  },
  {
    'questionText': 'مقدار الجهد الذي المبذول في مقاومة الأفكار الوسواسية (بغض النظر عن نجاحكفي المقاومة)',
    'answers': [
      {'text': 'لا أبذل جهدا حتى أقاومدائما (أو أن الأفكار قليلة جدا بحيث لا حاجةللمقاومة)', 'score': 0.0},
      {'text': 'أحاول أن أقاوم معظم الوقت ', 'score': 1.0},
      {'text': 'أبذل بعض الجهد حتى أقاوم ', 'score': 2.0},
      {'text': ' أستسلم لكل الأفكار الوسواسية بدون محاولة للسيطرة عليها، وإن حاولت السيطرة فيكون بعد تردد', 'score': 3.0},
      {'text': ' أستسلم كلية وبإرادتي للأفكار الوسواسية كلها', 'score': 4.0},
    ]
  },
  {
    'questionText': 'مقدار سيطرتك على الأفكار الوسواسية',
    'answers': [
      {'text': 'سيطرة تامة', 'score': 0.0},
      {'text': 'سيطرة كبيرة، عادة يمكنني أن أوقف أو أصرف انتباهي عن الوسواس عند بذل بعض الجهد والتركيز', 'score': 1.0},
      {'text': 'سيطرة متوسطة، بعض لأحيان استطيع إيقاف أو صرف انتباهی عن الوسواس', 'score': 2.0},
      {'text': 'سيطرة قليلة، نادرا ما أنجح في إيقاف الوساوس، أستطيع فقط صرف الانتباه وبصعوبة', 'score': 3.0},
      {'text': ' لا سيطرة، نادرا ما أستطيع صرف الانتباه عن الوساوس ولو للحظات قليلة', 'score': 4.0},
    ]
  },

  {
    'questionText': 'مقدار الوقت الذي تمضيه في القيام بالأفعال القهرية',
    'answers': [
      {'text': 'لاشيء', 'score': 0.0},
      {'text': 'أقل من ساعة في اليوم ، أو تقوم بالأفعال أحيانا (لا تزيد عن 8 مرات في اليوم)', 'score': 1.0},
      {'text': 'من ساعة إلى ثلاث ساعات في اليوم، أو تقوم بالأفعال كثيرا ( أكثر من 8 مرات في اليوم ولكن معظم الساعات تخلو من الأفعال القهرية)', 'score': 2.0},
      {'text': 'أكثر من ثلاث ساعات في اليوم ، أو تقوم بالأفعال كثيرا جدا (أكثر من 8 مرات في اليوم وخلال معظمساعات اليوم)', 'score': 3.0},
      {'text': 'أكثر من 8 ساعات في اليوم أو تقوم بالأفعال بشكل دائم (أكثر من أن تحصيها ونادرا ماتمر ساعة لا تقوم فيها بالأفعال)', 'score': 4.0},
    ]
  },
  {
    'questionText': 'مقدار التعارض الذي تحدثه الأفعال القهرية في نشاطاتك الاجتماعية والعملية',
    'answers': [
      {'text': 'لا يوجد', 'score': 0.0},
      {'text': 'تعارض خفيف مع النشاطات الاجتماعية أو العملية ، ولكن النشاط العام لا يتأثر', 'score': 1.0},
      {'text': 'تعارض واضح مع النشاطات الأجتماعية أو العملية ولكن يمكن السيطرة عليها', 'score': 2.0},
      {'text': 'تسبب خللا كبيرا في أداء النشاطات الاجتماعية أو العملية', 'score': 3.0},
      {'text': 'تسبب عجزا كبيرا', 'score': 4.0},
    ]
  },
  {
    'questionText': ' مقدار التوتر والقلق الناتج في حال الامتناع عن القيام بالأفعال القهرية',
    'answers': [
      {'text': 'لا يوجد', 'score': 0.0},
      {'text': 'قلق بسيط عند الامتناع عن القيام بالأفعال', 'score': 1.0},
      {'text': 'يظهر القلق لكن يمكن تحمله', 'score': 2.0},
      {'text': 'قلق واضح ومزعج للغاية', 'score': 3.0},
      {'text': 'قلق شديد بسبب عجزا بليغا', 'score': 4.0},
    ]
  },
  {
    'questionText': 'مقدار الجهد المبذول في مقاومة الأفعال القهرية (بغض النظر عن مدى نجاحك في المقاومة)',
    'answers': [
      {'text': ' أبذل جهدا حتى أقاوم دائما (أو أن الأفعال القهرية قليلة بحيث لا حاجة للمقاومة)', 'score': 0.0},
      {'text': 'أحاول أن أقاوم معظم الوقت', 'score': 1.0},
      {'text': 'أعمل بعض المحاولات للمقاومة', 'score': 2.0},
      {'text': 'استسلم لكل الأفعال القهرية بدون محاولة للسيطرة عليها ، وإن حاولت السيطرة فيكون بعد تردد', 'score': 3.0},
      {'text': 'أستسلم كلية وبإرادتي لكل الأفعال القهرية', 'score': 4.0},
    ]
  },
  {
    'questionText': 'مقدار سيطرتك على الأفعال القهرية',
    'answers': [
      {'text': 'سيطرة تامة', 'score': 0.0},
      {'text': 'عادة ما أوقف الأفعال القهرية بصعوبة', 'score': 1.0},
      {'text': 'أحيانا أستطيع إيقاف الأفعال القهرية بصعوبة', 'score': 2.0},
      {'text': 'أستطيع بصعوبة أن أؤخر . فقط . الأفعال القهرية لكن يجب على القيام بها حتى النهاية', 'score': 3.0},
      {'text': 'نادرا ما أستطيع أن أؤخر القيام بالأفعال القهرية ولو للحظات', 'score': 4.0},
    ]
  },
];